<?php

$lang = [
    'langSelect' => 'Язык',

    'menu_top' => [
        'home' => 'Главная',
        'news' => 'Новости',
        'contact' => 'Контакты',
        'account' => 'Мой аккаунт',
        'payments' => 'Платежи',
        'exit' => 'Выйти с аккаунта',
    ],

    'menu_left' => [
        '_home' => 'Главная страница',
        '_acc' => 'Аккаунт',
        '_game' => 'Игра',
        '_earn' => 'Заработок',

        'login' => 'Войти',
        'register' => 'Регистрация',
        'resetpass' => 'Восстановить пароль',
        'rules' => 'Правила',
        'about' => 'О нас',
        'statistics' => 'Статистика',
        'info' => 'Информация',
        'game' => 'Игра',

        'profit' => 'Прогресс прибыли: ',
        'p_balance' => 'Покупки',
        'w_balance' => 'Баланс',
        'account' => 'Мой аккаунт',
        'referrals' => 'Мои рефералы',
        'messages' => 'Сообщения',
        'config' => 'Настройки аккаунта',

        'games' => 'Игры',
        'bonus' => 'Бонус',
        'surf' => 'Смотреть рекламу',

        'farm' => 'Магазин',
        'store' => 'Собрать',
        'market' => 'Продать',
    ],

    'error_messages' => [
        'accountBanned' => 'Аккаунт заблокирован',
        'wrongLogin' => 'Электронная почта и/или пароль - неправильны',
        'notfoundAccount' => 'Эта электронная почта не зарегистрирована в системе',
        'captcha' => 'Captcha неправильна, попробуйте снова.',
        'usernameInUse' => 'Указанный логин уже используется',
        'passwordMatch' => 'Пароль и повторный пароль не совпадают',
        'emptyPassword' => 'Пароль неверен или пуст',
        'emptyLogin' => 'Логин неверен или пуст',
        'emailInvalid' => 'У введенной электронной почты неправильный формат',
        'tosConfirm' => 'Вы должны подтвердить правила пользования сервисом',
        'invalidData' => 'Были ошибки с данными, которые вы предоставили',
        'requestReset' => 'На ваш адрес электронной почты уже был отправлен пароль за последние 15 минут',
        'oldpassword' => 'Старый пароль неверен',
        'bonusCollected' => 'Вы уже получали бонус за эти 24 часа',
        'noresults' => 'Список пуст',
        'error404' => 'Страница не найдена',
    ],

    'success_messages' => [
        'changesSaved' => 'Изменения успешно сохранены',
        'bonusAdded' => 'Бонус был добавлен в количестве %s %s',
    ],

    'btn' => [
        'send' => 'Отправить',
        'edit' => 'Редактировать',
        'delete' => 'Удалить',
        'create' => 'Создать',
        'cancel' => 'Отменить',
        'login' => 'Войти',
        'register' => 'Регистрация',
        'forgotL' => 'Восстановление пароля',
        'forgot' => 'Отправить ссылку для восстановления',
        'deposit' => 'Пополнить',
        'withdraw' => 'Снять',
        'exchange' => 'Обменять',
        'save' => 'Сохранить',
        'getBonus' => 'Получить бонус',
        'buyNow' => 'Купить сейчас',
        'payNow' => 'Заплатить сейчас',
        'sellAll' => 'Все продать',
    ],

    'common' => [
        'email' => 'Электронная почта',
        'password' => 'Пароль',
        'password_old' => 'Старый пароль',
        'password_new' => 'Новый пароль',
        'captcha' => 'Ввести сaptcha',
        'captcha_h' => 'Нажмите на картинку, чтобы создать новую captcha',
        'auth' => 'Авторизация',
        'users' => 'Пользователи',
        'days' => 'Дни',
        'username' => 'Логин',
        'copyright' => 'Все права защищены.',
        'referrer' => 'Приглашён :',
        'p_balance' => 'Баланс покупок',
        'w_balance' => 'Баланс снятия',
        'ref_earnings' => 'Заработок с рефералов',
        'paid' => 'Всего заплачено',
        'resgetedOn' => 'Дата регистрации',
        'deposits' => 'Пополнение',
        'withdraws' => 'Снято',
        'referrals' => 'Рефералы',
        'date' => 'Дата',
        'wallet' => 'Кошелёк',
        'amount' => 'Количество',
        'status' => 'Статус',
        'status_paid' => 'Выплачено',
        'min' => 'Минимум',
        'conversionRate' => 'Коэффициент обмена',
    ],

    'home' => [
        'title' => 'Добро пожаловать',
        'total_users' => 'Всего пользователей',
        'working_time' => 'Время работы',
        'total_paid' => 'Всего заплачено',
        'first_label' => 'Добро пожаловать! Мы предлагаем вам сыграть в нашу захватывающую игру, чтобы поднять ваш бюджет!',
        'second_label' => 'У нас нет ограничений на оплату. Заработанные и выигранные деньги могут быть немедленно выведены на ваш кошелёк',
        'how_to_start' => 'Как начать играть?',
        'buy_and_earn' => 'Покупайте автомобили и получайте стабильный доход!',
        'aff_programm' => 'Система рефералов',
        '1_level_aff_programm' => '1-уровневая система рефералов до 15% при выводе!',
        'games' => 'Игры',
        'play_get_paid' => 'Играйте в нашу захватывающюю игру и получайте деньги!',
        'register_button' => 'Зарегистрируйся и получи бонус'
    ],

    'news' => [
        'title' => 'Новости',
        'noNews' => 'Новости не найдены',
    ],

    'about' => [
        'title' => 'О нас',
    ],

    'rules' => [
        'title' => 'Правила',
    ],

    'statistics' => [
        'title' => 'Статистика',
        'subtitle' => 'Статистика проекта',
        'totalUsers' => 'Игроков',
        'users24' => 'За 24 часа',
        'projectStart' => 'Проект cуществует',
        'deposits' => 'Пополнено',
        'reserve' => 'Резерв проекта',
        'withdraws' => 'Выплачено',
    ],

    'contact' => [
        'title' => 'Свяжитесь с нами',
    ],

    'register' => [
        'title' => 'Регистрация',
        'username_h' => 'Поле имени пользователя должно иметь от 4 до 20 буквенно-цифровых символов (только английские символы).',
        'password_h' => 'Поле пароля должно иметь от 4 до 20 буквенно-цифровых символов (только английские символы).',
        'passConfirm' => 'Подтверждение пароля.',
        'passConfirm_h' => 'Пароль должен совпадать.',
        'acceptRules' => 'Я знаком с правилами проекта и принимаю их.',
    ],

    'recovery' => [
        'title' => 'Восстановление пароля',
        'requestSended' => 'Ссылка восстановления отправлена к вам на почту',
        'resetSuccess' => 'Ваш пароль успешно сменён, вы можете зайти в свой аккаунт',
    ],

    'fail' => [
        'title' => 'Неудачное пополнение',
        'text' => 'Мы не можем подтвердить ваше пополнение. Если проблема повториться, свяжитесь с администратором.',
    ],

    'success' => [
        'title' => 'Пополнение подтверждено',
        'text' => 'Вы успешно пополнили счет. Сумма уже доступна на вашем аккаунте.',
    ],

    'account' => [
        'title' => 'Мой аккаунт',
        'details' => 'Детали аккаунта',
        'statistics' => 'Статистика аккаунта',
        'chart' => 'График',
    ],

    'referrals' => [
        'title' => 'Мои рефералы',
        'refs_total' => 'Всего рефералов',
        'ref_revenue' => 'Доход от реферала',
        'noreferrals' => 'У вас еще нет рефералов',
        'description' => 'Пригласите своих друзей и знакомых в игру, вы получите 10 процентов от каждого пополнения, приглашенного вами человека. Доход не ограничен. Даже несколько гостей могут принести вам больше, чем 100,000 %s. Ниже приведена ссылка для приглашения и количество приглашенных вами людей.'
    ],

    'acc_settings' => [
        'title' => 'Настройки аккаунта',
        '_password' => 'Сменить пароль',
        'old_password' => 'Введите текущий пароль для смены',
        'updated' => 'Данные успешно изменены',
    ],

    'bonus_daily' => [
        'title' => 'Ежедневный бонус',
        'desc' => 'Как это работает',
        'rule1' => 'Бонус можно получить только раз в день.',
        'rule2' => 'Бонус выдается на баланс покупки.',
        'rule3' => 'Количество бонусов случайно генерируется от %s до %s %s.',
        'leftTime' => 'Пожалуйста подождите: ',
        'last_20' => 'Последние 20 выплат',
        'no_rec' => 'Нет записей',
    ],

    'payments' => [
        'title' => 'Последние выплаты',
        'subtitle' => 'Выплаты за последние 48 часов',
        'count' => 'Всего выплачено',
        'total' => 'Общая сумма',
    ],

    'store' => [
        'title' => 'Склад',
        'subtitle' => 'Выплаты за последние 48 часов',
        'count' => 'Всего выплачено',
        'total' => 'Общая сумма',
        'success' => '%s успешно собрано',
        'error' => 'Вы не можете собрать не более 1 раза за 10 минут',
        'stock' => 'У вас на складе',
        'quantity' => 'Количество',
    ],

    'farm' => [
        'title' => 'Магазин',
        'text' => 'В магазине вы можете купить %s. Каждая %s приносит %s, которые затем могут быть проданы на рынке и обменены на реальные деньги. Каждая %s дает разное количество %s, более дорогие, больше %s она генерирует. Вы можете купить любое их количество, %s не имеют срока годности, он всегда будет генерировать %s в вашем аккаунте.',
        'alert' => 'Перед покупкой вы должны собрать свои %s на складе!',
        'purchased' => '%s успешно куплено!',
        'noEnoughCoins' => 'Недостаточно средств %s чтобы купить это предмет',
        'perHour' => 'В час',
        'perMonth' => 'За месяц',
        'warehouse' => 'На складе',
    ],

    'market' => [
        'title' => 'Торговый магазин',
        'text' => 'Торговый магазин позволит вам продать все ваши %s, которые можно обменять на реальные деньги. Полученые %s от продажи распределяется между двумя балансами (баланс для вывода и баланс покупки) в пропорции %s%% на баланс покупок и %s%% на баланс для вывода.',
        'error' => 'У вас нечего продать',
        'sold' => 'Вы продали %s %s, на сумму %s %s',
    ],

    'swap' => [
        'title' => 'Обмен',
        'text' => 'В обменном пункте вы можете обменять баланс для вывода на баланс покупки. Когда вы обмениваете вы получите %s%% бонус на баланс покупок.',
        'alert' => 'Обмен возможен только в одном направлении',
        'give' => 'Вы отдаете',
        'receive' => 'Вы получаете',
        'success' => 'Обмен совершён успешно.',
        'errorBalance' => 'Недостаточно средств для обмена',
        'errorMin' => 'Минимум для обмена: ',
    ],

    'insert' => [
        'title' => 'Пополнение',
        'text' => 'Оплата и перевод серебра на баланс производится автоматически. После пополнения вам будет приписано %s.',
        'receive' => 'Вы получите',
        'errorMin' => 'Минимум для пополнения: ',
    ],

    'payment' => [
        'title' => 'Снятие',
        'give' => 'Вы отдаете',
        'description_1' => 'Платежи производятся автоматически и только в платежной системе',
        'description_2' => 'Процент снятия составляет 0%.',
        'receive' => 'Вы получаете',
        'latests' => 'Последние 10 выплат',
        'success' => 'Ваш запрос на снятие средств успешно выполнен!',
        'errorUnknown' => 'Внутренняя ошибка - сообщите об этом администратору!',
        'error629' => 'Ошибка 629. Сообщите об этом администратору!',
        'error630' => 'Ошибка 630. Не получилось заплатить. Попробуйте позже!',
        'error631' => 'Ошибка 631. Не получилось заплатить. Попробуйте позже!',
        'errorWait' => 'У вас есть необработанные выплаты. Ждите их завершения.',
        'errorMax' => 'Вы указали больше, чем есть в своем аккаунте',
        'errorMin' => 'Минимальная сумма для вывода: %s %s!',
        'errorWallet' => 'Неправильный кошелёк, попробуйте снова.',
    ],
];
